---
title: SaveAsOptions
classe: Autodesk.Revit.DB.SaveAsOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# SaveAsOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean Compact { get; set; }` | `saveAsOptions.Compact` | Boolean |
| `Boolean IsValidObject { get; }` | `saveAsOptions.IsValidObject` | Boolean |
| `Int32 MaximumBackups { get; set; }` | `saveAsOptions.MaximumBackups` | Int32 |
| `Boolean OverwriteExistingFile { get; set; }` | `saveAsOptions.OverwriteExistingFile` | Boolean |
| `ElementId PreviewViewId { get; set; }` | `saveAsOptions.PreviewViewId` | ElementId |
| `Void Dispose()` | `saveAsOptions.Dispose()` | Void |
| `WorksharingSaveAsOptions GetWorksharingOptions()` | `saveAsOptions.GetWorksharingOptions()` | WorksharingSaveAsOptions |
| `Void SetWorksharingOptions(WorksharingSaveAsOptions)` | `saveAsOptions.SetWorksharingOptions(worksharingOptions)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```